[
  {
    "title": "WWE Star Tiffany Stratton's Least Favorite Moves To Take",
    "summary": "WWE Women's Champion Tiffany Stratton detailed her least favorite moves to be on the receiving end of in the ring.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/1970966/wwe-star-tiffany-stratton-least-favorite-moves-take/",
    "publishedAt": "2025-09-19T12:30:00+00:00",
    "category": "raw"
  },
  {
    "title": "Thekla On AEW All Out: I'm Very Excited About It Because All Three Of My Opponents Are Bad Bitches",
    "summary": "Thekla is excited for AEW All Out. 'The Toxic Spider' will compete in her second pay-per-view match at AEW All Out, facing off against Jamie Hayter, Kris Statlander, and Toni Storm for the AEW...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/thekla-aew-all-out-255704",
    "publishedAt": "2025-09-19T12:28:34+00:00",
    "category": "raw"
  },
  {
    "title": "Seth Rollins Says He Has A Couple Years Left On WWE Contract",
    "summary": "Seth Rollins has been one of the faces of WWE for over a decade, and is the reigning WWE World Heavyweight Champion. Appearing on Nightcap with Shannon Sharpe and Chad Ochocinco, Rollins commented on...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/seth-rollins-says-he-has-a-couple-years-left-on-wwe-contract",
    "publishedAt": "2025-09-19T11:42:46+00:00",
    "category": "raw"
  },
  {
    "title": "Chad Ochocinco Says He'd Love To Share The Ring With Seth Rollins",
    "summary": "Chad Ochocinco is one of the most charismatic wide receivers in NFL history, known for his on-field production and celebrations. On Nightcap, Ochocinco and Shannon Sharpe welcomed WWE World...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/chad-ochocinco-says-hed-love-to-share-the-ring-with-seth-rollins",
    "publishedAt": "2025-09-19T11:24:13+00:00",
    "category": "raw"
  },
  {
    "title": "Cassie Lee On WWE Creative: “It Was A Battle”",
    "summary": "TNA star Cassie Lee, formerly known as Peyton Royce in WWE, has opened up about the differences in the creative process between the two promotions, praising TNA for the trust and freedom it affords...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/cassie-lee-wwe-creative-battle/",
    "publishedAt": "2025-09-19T10:58:28+00:00",
    "category": "raw"
  },
  {
    "title": "Ricky Morton To Wrestle Kerry Morton This November At BRCW Summer Smash 3",
    "summary": "The following was sent to us: RICKY MORTON TO FACE SON KERRY MORTON AT BRCW NOVEMBER KNOCKDOWN Boca Raton Championship Wrestling (BRCW) has officially announced a generational showdown for its...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/other/ricky-morton-wrestle-kerry-morton-november-brcw-summer-smash/",
    "publishedAt": "2025-09-19T10:12:04+00:00",
    "category": "raw"
  },
  {
    "title": "TNA Wrestling Presents Knockouts Ringside Photo-Op On September 27 In Edmonton",
    "summary": "The following was issued to us: September 18, 2025 For Immediate Release TNA Wrestling Presents Knockouts Ringside Photo-Op on September 27 in Edmonton TNA Wrestling brings its first live events to...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/tna-news/tna-wrestling-presents-knockouts-ringside-photo-september-edmonton/",
    "publishedAt": "2025-09-19T10:11:13+00:00",
    "category": "raw"
  },
  {
    "title": "JBL On Eddie Guerrero: The World Was Robbed When Eddie Died, He Had So Much Left",
    "summary": "John Bradshaw Layfield's first main event feud in WWE was with Eddie Guerrero. He would eventually defeat Eddie Guerrero for his one and only WWE Championship run in 2004. Behind the scenes, Bradshaw...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/jbl-on-eddie-guerrero-the-world-was-robbed-when-eddie-died-he-had-so-much-left",
    "publishedAt": "2025-09-19T03:38:27+00:00",
    "category": "raw"
  },
  {
    "title": "Raja Jackson Taken Into Custody For Attack On Wrestler Syko Stu",
    "summary": "Raja Jackson, 25, the son of mixed martial arts fighter Quinton “Rampage” Jackson, was arrested Thursday on a felony charge in connection with a late August incident at a wrestling event. As first...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/raja-jackson-taken-into-custody-attack-wrestler-syko-stu/",
    "publishedAt": "2025-09-19T02:59:49+00:00",
    "category": "raw"
  },
  {
    "title": "Raja Jackson Arrested, Booked On Felony Charge For Incident With Syko Stu",
    "summary": "Raja Jackson has been arrested and booked on a felony charge for his role in an incident with Syko Stu at a Knox Pro Wrestling event in August. The exact charge was not listed. At the event, Raja...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/raja-jackson-arrested-booked-on-felony-charge-for-incident-with-syko-stu",
    "publishedAt": "2025-09-19T02:52:37+00:00",
    "category": "raw"
  },
  {
    "title": "Bully Ray Needed To See A Little More Self-Doubt From This Star On WWE Raw",
    "summary": "WWE Hall of Famer Bully Ray would have liked to have seen a little more self-doubt displayed from a certain star on \"WWE Raw\" this week.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/1972477/wwe-raw-bully-ray-aj-lee-self-doubt-neck-injury/",
    "publishedAt": "2025-09-19T01:56:16+00:00",
    "category": "raw"
  },
  {
    "title": "Plans For Scheduled Match At WWE Wrestlepalooza May Change Due To Tiffany Stratton’s Status",
    "summary": "A new report from WrestleVotes has provided an update on a potential high-profile women’s match for this Saturday’s WWE Wrestlepalooza premium live event. The report addresses a matchup graphic that...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/plans-scheduled-match-wwe-wrestlepalooza-may-change-due-tiffany-strattons-status/",
    "publishedAt": "2025-09-18T23:46:24+00:00",
    "category": "raw"
  },
  {
    "title": "Bully Ray Really Likes This WWE Star For A Symbolic Final John Cena Match",
    "summary": "WWE Hall of Famer Bully Ray has a possibility in mind for the last opponent of John Cena's in-ring career.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/1972448/wwe-bully-ray-john-cena-last-match-dominik-mysterio-intercontinental-title/",
    "publishedAt": "2025-09-18T23:43:42+00:00",
    "category": "raw"
  },
  {
    "title": "Nikki Bella: “Breakup Diets Work Real Well For The Revenge”",
    "summary": "WWE Hall of Famer Nikki Bella is back in the ring and in phenomenal shape, a transformation she playfully credits to the classic “revenge body” motivation. In a new interview, the former Divas...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/nikki-bella-breakup-diets-work-real-well-revenge/",
    "publishedAt": "2025-09-18T22:58:42+00:00",
    "category": "raw"
  },
  {
    "title": "AEW's Will Ospreay Announces He's Undergone Successful Neck Surgery",
    "summary": "Former AEW International Champion Will Ospreay confirms that he has undergone successful neck surgery.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/1972413/aew-will-ospreay-announces-undergone-successful-neck-surgery/",
    "publishedAt": "2025-09-18T22:32:19+00:00",
    "category": "raw"
  },
  {
    "title": "WWE Wrestlepalooza 2025: Draws And Duds",
    "summary": "With WWE Wrestlepalooza 2025 on the horizon, it's time to find out which match is drawing the eye of the Wrestling Inc. staff, and which we see as a dud.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/1972180/wwe-wrestlepalooza-2025-draws-duds-stephanie-vaquer-iyo-sky-brock-lesnar-john-cena/",
    "publishedAt": "2025-09-18T18:50:15+00:00",
    "category": "raw"
  },
  {
    "title": "Booker T Wonders If This Holds Former WWE Star Andrade Back, Despite Abilities",
    "summary": "WWE legend Booker T has discussed Andrade's exit from WWE and one potential reason he didn't receive as big a push as some might have expected.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/1971675/wwe-booker-t-andrade-fluent-english/",
    "publishedAt": "2025-09-18T15:00:00+00:00",
    "category": "raw"
  },
  {
    "title": "AJ Lee Explains Decision To Make WWE Return In 2025 Despite Feeling 'Very Complete'",
    "summary": "AJ Lee reveals why she stayed retired from professional wrestling for the past decade, and shares what convinced her to return to the ring.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/1971850/aj-lee-explains-decision-make-wwe-return-2025-despite-feeling-very-complete/",
    "publishedAt": "2025-09-18T14:33:40+00:00",
    "category": "raw"
  }
]