[
  {
    "title": "Ash By Elegance Will Make An Announcement At TNA Victory Road",
    "summary": "Ash By Elegance will be making an announcement at TNA Victory Road. Ash By Elegance was initially supposed to defend the TNA Knockouts World Championship against Masha Slamovich at the TNA Victory...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/ash-by-elegance-will-make-an-announcement-at-tna-victory-road",
    "publishedAt": "2025-09-26T18:24:54+00:00",
    "category": "raw"
  },
  {
    "title": "Backstage News On Brock Lesnar’s WWE Status",
    "summary": "Brock Lesnar made a destructive return to WWE at Wrestlepalooza, but fans shouldn’t expect to see “The Beast Incarnate” on weekly television anytime soon. According to a new report from Fightful...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/backstage-news-brock-lesnars-wwe-status/",
    "publishedAt": "2025-09-26T18:22:54+00:00",
    "category": "raw"
  },
  {
    "title": "Report Details Reasoning Behind Unusual Build For Upcoming WWE Match",
    "summary": "The build for John Cena's match with AJ Styles at WWE Crown Jewel caught fan's attention online, but there are a few reasons why the match was built that way.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/1979448/wwe-crown-jewel-2025-perth-build-john-cena-aj-styles/",
    "publishedAt": "2025-09-26T17:13:14+00:00",
    "category": "raw"
  },
  {
    "title": "Eddie Kingston Returning To Beyond At Novembercanrana",
    "summary": "Eddie Kingston will return to Beyond Wrestling at Novembercanrana on November 14. This would be Kingston's first match at Beyond in 2022. No opponent was announced for Kingston. Kingston was...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/eddie-kingston-returning-to-beyond-at-novembercanrana",
    "publishedAt": "2025-09-26T16:09:33+00:00",
    "category": "raw"
  },
  {
    "title": "The Miz: Triple H “Has One Of The Best Minds In The Business”",
    "summary": "With WWE WrestleMania 42 in Las Vegas on the horizon, The Miz has shared his complete faith in the creative direction of Paul “Triple H” Levesque. In a recent interview with The Schmo to promote the...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/miz-triple-one-best-minds-business/",
    "publishedAt": "2025-09-26T15:01:05+00:00",
    "category": "raw"
  },
  {
    "title": "The Miz: Triple H Has One Of The Best Wrestling Minds I've Ever Seen",
    "summary": "The Miz would like to be a major fixture at WrestleMania 42 in Las Vegas, but no matter what happens, he trusts Triple H's vision. The Miz has been a top WWE star for over a decade. However, he is...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/the-miz-triple-h-has-one-of-the-best-wrestling-minds-ive-ever-seen",
    "publishedAt": "2025-09-26T14:44:44+00:00",
    "category": "raw"
  },
  {
    "title": "TNA Wrestler In WWE NXT Invasion Reportedly Working Without A Contract",
    "summary": "A TNA Wrestling representative reportedly invaded the \"WWE NXT\" brand this week without an official contract from TNA.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/1979229/wwe-nxt-tna-talent-working-without-contract-matt-cardona/",
    "publishedAt": "2025-09-26T14:23:01+00:00",
    "category": "raw"
  },
  {
    "title": "Absent WWE Star Is Returning To TV “Imminently”",
    "summary": "Former WWE United States Champion Jacob Fatu is expected to make his return to WWE television imminently, according to a new report. In the latest edition of the Wrestling Observer Newsletter, Dave...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/absent-wwe-star-returning-imminently/",
    "publishedAt": "2025-09-26T13:24:30+00:00",
    "category": "raw"
  },
  {
    "title": "Rumor Killer On Brock Lesnar Vs. John Cena Match Finish",
    "summary": "New details are out regarding the booking of the Brock Lesnar vs. John Cena match at WWE Wrestlepalooza, clarifying that Lesnar’s dominant victory was always the intended outcome. In the latest...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/rumor-killer-brock-lesnar-john-cena-match-finish/",
    "publishedAt": "2025-09-26T13:21:41+00:00",
    "category": "raw"
  },
  {
    "title": "Booker T Says These WWE Wrestlepalooza Opponents Weren't Clicking In Match",
    "summary": "WWE Hall of Famer Booker T believes that some WWE Wrestlepalooza opponents were not clicking in their respective match.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/1978978/wwe-wrestlepalooza-booker-t-usos-bronson-reed-bron-breakker-not-clicking/",
    "publishedAt": "2025-09-26T01:51:57+00:00",
    "category": "raw"
  }
]